IDEA Open Model
ConnectionData.ConcreteBlocks Property
Compatible with IDEA StatiCa v 10.1
 ConcreteBlocksof the connection
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public List<ConcreteBlockData> ConcreteBlocks { get; set; }
Public Property ConcreteBlocks As List(Of ConcreteBlockData)
	Get
	Set
public:
property List<ConcreteBlockData^>^ ConcreteBlocks {
	List<ConcreteBlockData^>^ get ();
	void set (List<ConcreteBlockData^>^ value);
}
Property Value
Type: List<ConcreteBlockData>
See Also
Reference
ConnectionData Class
IdeaRS.OpenModel.Connection Namespace